Ran Plan for dir: `default-workflow` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=559167400212]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.my-role will be created
+ resource "aws_iam_role" "my-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ user_id = "AIDAYEMHZNEKADCX3I6ZK"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d default-workflow
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://ddbb9e71c63a.ngrok-free.app/lock?id=alex-carvalho%252Fatlantis-poc%252Fdefault-workflow%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d default-workflow
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```